### 6001: [기초-출력] 출력하기01

```python
print("Hello")
```

### 6002 : [기초-출력] 출력하기02

```python
print("Hello World")
```

### 6003 : [기초-출력] 출력하기03

```python
print('Hello \nWorld')
```

### 6004 : [기초-출력] 출력하기04

```python
print("'Hello'")
```

### 6005 : [기초-출력] 출력하기05

```python
print('"Hello World"')
```

### 6006 : [기초-출력] 출력하기06

- 큰 따옴표

```python
print("\"!@#$%^&*()'")
```

- 작은 따옴표

```python
print('"!@#$%^&*()\'')
```

### 6007 : [기초-출력] 출력하기07

```python
print("\"C:\\Download\\'hello'.py\"")
```

- \를 안전하게 출력하려면  \\를 사용.

### ****6008 : [기초-출력] 출력하기08****

```python
#1
print("print(\"Hello\\nWorld\")")
#2
print("""print("Hello \\nWorkld")""")
```

- 이스케이프 시퀀스 사용

### ****6009 : [기초-입출력] 문자 1개 입력받아 그대로 출력하기****

```python
#1 변수를 받아서 출력
x = input()
print(x)

#2 변수없이 입력받아서 출력
print(input()
```

### ****6010 : [기초-입출력] 정수 1개 입력받아 int로 변환하여 출력하기****

```python

#1 변수를 받아서 출력
x = int(input())
print(x)

#2 변수없이 입력받아서 출력
print(int(input())
```

### ****6011 : [기초-입출력] 실수 1개 입력받아 변환하여 출력하기****

```python
#1 변수를 받아서 출력
f = float(input())
print(f)

#2 변수없이 입력받아서 출력
print(float(input()))
```

### ****6012 : [기초-입출력] 정수 2개 입력받아 그대로 출력하기1****

```python
a= input()
b = input()
print(a)
print(b)
```

### ****6013 : [기초-입출력] 문자 2개 입력받아 순서 바꿔 출력하기1****

```python
a= input()
b = input()
print(b)
print(a)
```

### ****6014 : [기초-입출력] 실수 1개 입력받아 3번 출력하기****

```python
a = float(input())
for i in range(0,3):
  print(a)
```

- 입력받은 수를 실수형으로 변환(확인)하고 for문을 세번 돌려준다.

### ****6015 : [기초-입출력] 정수 2개 입력받아 그대로 출력하기2****

```python
a, b = map(int,input().split())
print(a)
print(b)
```

### ****6016 : [기초-입출력] 문자 2개 입력받아 순서 바꿔 출력하기2****

```python
a, b = map(str,input().split())
print(b)
print(a)
```

### ****6017 : [기초-입출력] 문장 1개 입력받아 3번 출력하기****

```python
s = input()
print(s,s,s)
```

### ****6018 : [기초-입출력] 시간 입력받아 그대로 출력하기****

```python
a, b = input().split(':')
print(a,b, sep=':')
```

### 💬개념 (sep, end, format)

1. sep(separation) : 단어 뜻 ‘**분리**’ 말 그대로 단어와 단어사이의 **구분자**가 되어 분리해준다. 

```python
a, b, c = map(int, input().split(","))
print(a,b,c, sep=',')

# 입력값 1, 2, 3
# 출력값 1, 2, 3
```

1. end : 줄바꿈을 하지 않는다.
- 예를 들어서 print() print()로 두번 출력했다면 각각 다른줄에 출력값이 나온다. 하지만 end 옵션을 사용하면  줄바꿈을 하지 않게 만들 수 있다.

```python
a, b = map(int, input().split())
print(a, end=" ")
print(b, end=" ")

# 입력값 1, 2
# 출력값 1, 2

a, b = map(str, input().split())
print(a, end='지말라는 ')
print(b, end='의 요청')

# 입력값 가, 나
# 출력값 가지말라는 나의 요청
```

1. format :  부분적으로 문자를 넣어서 출력 할 수 있는 옵션이다.

```python
print("{}곱하기 {}은 {}입니다".format(3,5,3*5))

# 출력 : 3곱하기 5은 15입니다
```

### ****6019 : [기초-입출력] 연월일 입력받아 순서 바꿔 출력하기****

```python
y, m, d = input().split('.')
print(d,m,y, sep='-')
```

### ****6020 : [기초-입출력] 주민번호 입력받아 형태 바꿔 출력하기****

```python
x, y = input().split('-')
print(x+y)

'''
입력값
322456-3253525

출력값
3224563253525
'''
```

### ****6021 : [기초-입출력] 단어 1개 입력받아 나누어 출력하기****

```python
x = input()
print(x[0])
print(x[1])
print(x[2])
print(x[3])
print(x[4])
```

### ****6022 : [기초-입출력] 연월일 입력받아 나누어 출력하기****

```python
x = input() #221122
print(x[0:2], end=' ')
print(x[2:4], end=' ')
print(x[4:6], end=' ')
```

### ****6023 : [기초-입출력] 시분초 입력받아 분만 출력하기****

```python
x = input().split(':')
print(x[1])
```

****6024 : [기초-입출력] 단어 2개 입력받아 이어 붙이기****

```python
a, b = map(str, input().split())
print(a+b)
```

### ****6025 : [기초-값변환] 정수 2개 입력받아 합 계산하기****

```python
a, b = map(int,input().split())
print(a+b)
```

### ****6026 : [기초-값변환] 실수 2개 입력받아 합 계산하기****

```python
a = float(input())
b = float(input())

print(a+b)

# format사용
a = int(input())
b = int(input())
print('{}'.format(a+b))
```

- **2개의 실수가 줄을 바꿔 입력된다.** 부분에 유의\

### ****6027 : [기초-출력변환] 10진 정수 입력받아 16진수로 출력하기1****

```python
print('%x'%int(input()))
```

### 💬 개념 (2진수, 8진수, 16진수) 10진수를 변환

- 2진수는 Binary → bin → b
- 8진수는 Octual → oct → o
- 16진수는 Hexadecimal → hex → x
- 각 메소드에 10진수를 넣는 방식으로 변환한다.

```python
# 10을 2진수 변환
print(bin(int(input())))

print(format(10, '#b'))

print('{:#b}'.format(10))

# 10을 8진수 변환
print(oct(int(input())))

print(format(10, '#o'))

print('{:#o}'.format(10))

# 10을 16진수 변환
print(hex(int(input())))

print(format(10, '#x'))

print('{:#x}'.format(10))
```

### ****6028 : [기초-출력변환] 10진 정수 입력받아 16진수로 출력하기2****

```python
print('%X'%int(input()))
```

### ****6029 : [기초-값변환] 16진 정수 입력받아 8진수로 출력하기****

```python
a = input()
x = int(a, 16)
print('%o'%x)
```

### ****6030 : [기초-값변환] 영문자 1개 입력받아 10진수로 변환하기****

```python
print(ord(input()))
```

- 10진수 유니코드 변환시 ord()를 사용한다.
- ord()는 어떤 문자의 순서 위치(ordinal position)의 약자